api/Modules/v1/Models/User.php

    public function saveAllowance($request, $action, $allowance, $timestamp)
    {
        $this->allowance = $allowance;
        $this->allowance_updated_at = $timestamp;
        $this->save();
---
UPDATE `user` SET `allowance`=0, `allowance_updated_at`=1510050458 WHERE `id`=1

    public static function findIdentityByAccessToken($token, $type = null)
    {
        return static::findOne(['access_token' => $token]);
---
SELECT * FROM `user` WHERE `access_token`='ddf061559c21b91e2e516f32c7863493'